Revit 2024 API
BuiltInFailures.RoofFailures.HoleInRoofFailed Property
 Hole(s) could not be cut in roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId HoleInRoofFailed { get; }
Visual Basic
Public Shared ReadOnly Property HoleInRoofFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ HoleInRoofFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace